app/Controllers/Penjualan.php

    public function index()
    {
        $data = [
            'list-penjualan' => $this->penjualan->findAll()
        ];
---
SELECT *
FROM `penjualan`