app/Controllers/Produk.php

SELECT *
FROM `kategori`
SELECT *
FROM `satuan`
---
    public function tambahProduk()
    {
        $data = [
            'listKategori' => $this->kategori->findAll(),
            'listSatuan' => $this->satuan->findAll(),
            'kode_produk' => $this->produk->generateProductCode()
        ];

SELECT *
FROM `kategori`
SELECT *
FROM `satuan`
---
    public function editProduk($idProduk)
    {
        $syarat = [
            'idProduk' => $idProduk
        ];
        $data = [
            'introText' => '<p>Berikut adalah data produk,silahkan tambahkan data baru pada halaman ini</p>',
            'judulHalaman' => 'Data Produk',
            'listProduk' => $this->produk->where($syarat)->findAll(),
            'listKategori' => $this->kategori->findAll(),
            'listSatuan' => $this->satuan->findAll(),