app/Models/Mproduk.php

SELECT `produk`.`idProduk`, `produk`.`kode_produk`, `produk`.`nama_produk`, `produk`.`harga_beli`, `produk`.`harga_jual`, `produk`.`diskon`, `satuan`.`satnama`, `kategori`.`katnama`, `produk`.`stok`
FROM `produk`
JOIN `satuan` ON `satuan`.`satid` = `produk`.`satid`
JOIN `kategori` ON `kategori`.`katid` = `produk`.`katid`
---
    public function getAllProduk()
    {
        $db = \config\Database::connect();
        $produk = $db->table('produk');
        $produk->select('produk.idProduk,produk.kode_produk, produk.nama_produk,produk.harga_beli,produk.harga_jual,produk.diskon,satuan.satnama,kategori.katnama,produk.stok');
        $produk->join('satuan', 'satuan.satid = produk.satid');
        $produk->join('kategori', 'kategori.katid = produk.katid');
        return $produk->get()->getResultArray();

SELECT *
FROM `produk`
ORDER BY `idProduk` DESC
 LIMIT 1
---
    public function generateProductCode()
    {

        $prefix = 'PRD';
        $lastProduct = $this->orderBy('idProduk','DESC')->first();